# Basic Panda

In [ ]:
from pandas import Series, DataFrame
import pandas as pd

In [163]:
sample_pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90])
print(sample_pandas_data)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [164]:
sample_pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90],index = ['a','b','c','d','e','f','g','h','i','j'])
print(sample_pandas_data)

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [165]:
print('Data : ', sample_pandas_data.values)
print('Index : ',sample_pandas_data.index)

Data :  [ 0 10 20 30 40 50 60 70 80 90]
Index :  Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [166]:
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Washington','Tokyo','Berlin','London','Paris'],
               'Birth_year':[1946,1954,1954,1964,1977],
               'Name':['Donald','Shinzo','Merkel','Boris','Macron']
              }

attri_data_frame1= DataFrame(attri_data1)
print(attri_data_frame1)

    ID        City  Birth_year    Name
0  100  Washington        1946  Donald
1  101       Tokyo        1954  Shinzo
2  102      Berlin        1954  Merkel
3  103      London        1964   Boris
4  104       Paris        1977  Macron

In [167]:
attri_data_frame1

    ID        City  Birth_year    Name
0  100  Washington        1946  Donald
1  101       Tokyo        1954  Shinzo
2  102      Berlin        1954  Merkel
3  103      London        1964   Boris
4  104       Paris        1977  Macron

In [168]:
attri_data_frame_index1 = DataFrame(attri_data1,index=['a','b','c','d','e'])
print(attri_data_frame_index1)

    ID        City  Birth_year    Name
a  100  Washington        1946  Donald
b  101       Tokyo        1954  Shinzo
c  102      Berlin        1954  Merkel
d  103      London        1964   Boris
e  104       Paris        1977  Macron

In [169]:
attri_data_frame_index1

    ID        City  Birth_year    Name
a  100  Washington        1946  Donald
b  101       Tokyo        1954  Shinzo
c  102      Berlin        1954  Merkel
d  103      London        1964   Boris
e  104       Paris        1977  Macron

In [170]:
attri_data_frame1.T

                     0       1       2       3       4
ID                 100     101     102     103     104
City        Washington   Tokyo  Berlin  London   Paris
Birth_year        1946    1954    1954    1964    1977
Name            Donald  Shinzo  Merkel   Boris  Macron

In [171]:
attri_data_frame1.Birth_year

0    1946
1    1954
2    1954
3    1964
4    1977
Name: Birth_year, dtype: int64

In [172]:
attri_data_frame1[['ID','Birth_year']]

    ID  Birth_year
0  100        1946
1  101        1954
2  102        1954
3  103        1964
4  104        1977

In [173]:
attri_data_frame1

    ID        City  Birth_year    Name
0  100  Washington        1946  Donald
1  101       Tokyo        1954  Shinzo
2  102      Berlin        1954  Merkel
3  103      London        1964   Boris
4  104       Paris        1977  Macron

In [174]:
attri_data_frame1[attri_data_frame1['City'] == 'Tokyo']

    ID   City  Birth_year    Name
1  101  Tokyo        1954  Shinzo

In [175]:
attri_data_frame_index1['City'] == 'Tokyo'

a    False
b     True
c    False
d    False
e    False
Name: City, dtype: bool

In [176]:
attri_data_frame1[attri_data_frame1['City'].isin(['Tokyo','London'])]

    ID    City  Birth_year    Name
1  101   Tokyo        1954  Shinzo
3  103  London        1964   Boris

In [177]:
attri_data_frame1.drop(['Birth_year'],axis=1)

    ID        City    Name
0  100  Washington  Donald
1  101       Tokyo  Shinzo
2  102      Berlin  Merkel
3  103      London   Boris
4  104       Paris  Macron

In [178]:
attri_data2 = {'ID':['100','101','102','105','107'],
               'Math':[50,43,33,76,98],
               'English':[90,30,20,50,30],
               'Sex':['M','M','F','M','M']
              }
attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame2

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   M
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [179]:
pd.merge(attri_data_frame1,attri_data_frame2)

    ID        City  Birth_year    Name  Math  English Sex
0  100  Washington        1946  Donald    50       90   M
1  101       Tokyo        1954  Shinzo    43       30   M
2  102      Berlin        1954  Merkel    33       20   F

In [180]:
attri_data_frame2.groupby('Sex')['Math'].mean()

Sex
F    33.00
M    66.75
Name: Math, dtype: float64

In [181]:
attri_data3 = {'ID':['100','101','102','103','104'],
               'City':['Washington','Tokyo','Berlin','London','Paris'],
               'Birth_year':[1946,1954,1954,1964,1977],
               'Name':['Donald','Shinzo','Merkel','Boris','Macron']
              }
attri_data_frame3  = DataFrame(attri_data3)
attri_data_frame3_index3 = DataFrame(attri_data3,index=['e','b','a','d','c'])
attri_data_frame3_index3

    ID        City  Birth_year    Name
e  100  Washington        1946  Donald
b  101       Tokyo        1954  Shinzo
a  102      Berlin        1954  Merkel
d  103      London        1964   Boris
c  104       Paris        1977  Macron

In [182]:
attri_data_frame3_index3.sort_index()

    ID        City  Birth_year    Name
a  102      Berlin        1954  Merkel
b  101       Tokyo        1954  Shinzo
c  104       Paris        1977  Macron
d  103      London        1964   Boris
e  100  Washington        1946  Donald

In [183]:
attri_data_frame3_index3.Birth_year.sort_values()

e    1946
b    1954
a    1954
d    1964
c    1977
Name: Birth_year, dtype: int64

In [184]:
attri_data_frame3_index3.isin(['Tokyo'])

      ID   City  Birth_year   Name
e  False  False       False  False
b  False   True       False  False
a  False  False       False  False
d  False  False       False  False
c  False  False       False  False

In [185]:
import numpy as np
attri_data_frame3_index3['Name'] =np.nan
attri_data_frame3_index3.isnull()

      ID   City  Birth_year  Name
e  False  False       False  True
b  False  False       False  True
a  False  False       False  True
d  False  False       False  True
c  False  False       False  True

In [186]:
attri_data_frame3_index3.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64

In [187]:
attri_data4 = {'ID':['1','2','3','4','5'],
               'Sex':['F','M','F','M','F'],
               'Money':[1000,2000,500,300,700],
               'Name':['Alice','Bob','Carol','Dave','Ellen']
              }
attri_data_frame4  = DataFrame(attri_data4)
attri_data_frame4

  ID Sex  Money   Name
0  1   F   1000  Alice
1  2   M   2000    Bob
2  3   F    500  Carol
3  4   M    300   Dave
4  5   F    700  Ellen

In [188]:
attri_data_frame4[attri_data_frame4.Money>=500]

  ID Sex  Money   Name
0  1   F   1000  Alice
1  2   M   2000    Bob
2  3   F    500  Carol
4  5   F    700  Ellen

In [189]:
attri_data_frame4.groupby('Sex')['Money'].mean()

Sex
F     733.333333
M    1150.000000
Name: Money, dtype: float64

In [190]:
attri_data5 = {'ID':['3','4','7'],
               'Sex':[60,30,40],
               'English':[80,20,30]
              }
attri_data_frame5  = DataFrame(attri_data5)
attri_data_frame5

  ID  Sex  English
0  3   60       80
1  4   30       20
2  7   40       30

In [191]:
merge_data = attri_data_frame5 .merge(attri_data_frame5)
merge_data.mean()

ID         115.666667
Sex         43.333333
English     43.333333
dtype: float64